## **Exercise 1**
---   

### *Information to be delivered*:

The 📓 notebook with the name "Name1_Surname1 - Name2_Surname2 - Name3_Surname3.ipynb": 


<div style="background-color: lightred; padding: 10px; border: 1px solid #ff0000;">
    <strong>⚠ Warning:</strong> 
        <br>
        1. You can only use the materials viewed in class.
        <br>
        2. If the code gives an error, the exercise will be considered as not solved.
        <br>
        3. Folder must be named as "Name1_Surname1 - Name2_Surname2 - Name3_Surname3"
</div>

### **Pandas**
---

In [3]:
import numpy as np
import pandas as pd

In [9]:
# CODE HERE:
df_train = pd.read_csv('train.csv', sep='|')
df_train.head()
# END CODE

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### **1. Pivot (0,5p.)**
---

Using the provided dataset, create a pivot table that shows the average fare (Fare) paid by passengers, grouped by Embarked and Pclass.

In [11]:
# CODE HERE:

pivot_table = df_train.pivot_table(index=('Pclass', 'Embarked'), values='Fare', aggfunc=np.mean)
display(pivot_table)

# END CODE

/var/folders/xt/8w_6k8m945g2tjrzls6q21mm0000gn/T/ipykernel_79081/643235727.py:3: FutureWarning: The provided callable <function mean at 0x111e2caf0> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pivot_table = df_train.pivot_table(index=('Pclass', 'Embarked' ), values='Fare', aggfunc=np.mean)

                       Fare
Pclass Embarked
1      C         104.718529
       Q          90.000000
       S          70.364862
2      C          25.358335
       Q          12.350000
       S          20.327439
3      C          11.214083
       Q          11.183393
       S          14.644083

### **2. Percentage of missing values (1p.)**
---
Get the percentage of missing values in each column of `df_train` and print only the columns with **more than 0% and less than 20% of missing values.**

In [12]:
# CODE HERE:


# END CODE

PassengerId - int64
Survived - int64
Pclass - int64
Name - object
Sex - object
Age - float64
SibSp - int64
Parch - int64
Ticket - object
Fare - float64
Cabin - object
Embarked - object

### **3. Pivot table (1p.)**
---

In [ ]:
data = {
    'Product_ID': [201, 202, 203, 204, 205],
    'Category': ['Electronics', 'Furniture', 'Clothing', 'Electronics', 'Furniture'],
    'Price': [300, 1500, 50, 250, 1200],
    'Stock_Quantity': [50, 20, 100, 60, 15]
}

product_data = pd.DataFrame(data)

In [ ]:
# a. Average price and median stock quantity in each category
avg_price_and_median_stock =

# b. Category with the highest average price
highest_price_category =

print("a) Average Price and Median Stock Quantity by Category:")
display(avg_price_and_median_stock)
print("b) Category with Highest Average Price:", highest_price_category)

### **4. Dict function (1p.)**
---
Create a function that given a dataframe return a dictionary with all the rows that have missing values and the number of missing values per row (`df_train`).   
The keys are the index (you must put "index X") and the values the number of missing values.    
Example:   
`{index 0: 1, 1: index 2, index 11: 1, index 45: 1, index 49: 1}`

In [ ]:
# CODE HERE:

def missing_values(___):

print(missing_values(____))
# END CODE

### **5. Duplicated function (2p.)**
---
Create a function that given a dataframe returns the same dataframe without the duplicated columns (`employee_data`). Remove the first column (you cannot put the column name, you must do it automatically) and return the dataframe without the duplicated columns.   

❌ Do not use the `drop_duplicates` or `duplicated` functions, **do it programmatically.**

In [ ]:
data = {
    'Employee_ID': [101, 102, 103, 104, 105],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR'],
    'Salary': [60000, 75000, 80000, 72000, 62000],
    'Years_Worked': [3, 5, 8, 2, 4],
    'Level': [3, 5, 8, 2, 4]
}

employee_data = pd.DataFrame(data)
employee_data

   Employee_ID Department  Salary  Years_Worked  Level
0          101         HR   60000             3      3
1          102         IT   75000             5      5
2          103    Finance   80000             8      8
3          104         IT   72000             2      2
4          105         HR   62000             4      4

In [ ]:
# CODE HERE:

def drop_duplicate_columns(___):

drop_duplicate_columns(____)
employee_data
# END CODE

### **6. Max Age (0,5p.)**
---
Print the PassengerId which Age is the highest (`df_train`). USE ONE LINE OF CODE.

In [ ]:
# CODE HERE:

# END CODE

### **7. Joins (1,5p.)**
---

In [ ]:
data_sales = {
    'Order_Code': [101, 102, 103, 104, 105],
    'Item_Code': ['I1', 'I2', 'I1', 'I3', 'I2'],
    'Units_Sold': [6, 3, 7, 5, 3],
    'Revenue': [600, 450, 700, 800, 450]
}
sales_data = pd.DataFrame(data_sales)

data_product = {
    'Item_Code': ['I1', 'I2', 'I3'],
    'Item_Name': ['Gadget_X', 'Apparel_Y', 'Book_Z'],
    'Type': ['Gadgets', 'Clothing', 'Literature']
}
product_info = pd.DataFrame(data_product)

In [ ]:
# a. Merge sales_data and product_info on 'Item_Code'
merged_sales_data =

# b. Calculate the total sales revenue (Revenue) for each type
total_sales_by_type =

print("a) Merged Sales Data:")
display(merged_sales_data)
print("\nb) Total Sales Revenue by Type:")
print(total_sales_by_type)

### **8. Programming (0,5p.)**
---

Write a piece of code that prompts you to enter a whole number on the screen and then prints N arrows on the screen, where N is the number entered, with the length of its characters starting at N and decreasing by 1 on each line until it reaches 1, similar to the one in the image below:    

<img src="flecha.png">

In [ ]:
# CODE HERE:
def arrow(___):


arrow(___)

# END CODE

### **9. Vowels (2p.)**
---
Write a code function that receives the `Name` column and return the number of vowels in the name. Put the result in a list and the create a new column in `df_train` called `n_vowels` with the result.

In [ ]:
# CODE HERE:

vowels = ['a', 'e', 'i', 'o', 'u']

def count_vowels(___, ____):


count_vowels(____, ____)
# END CODE

---